package main

// этот файл нужен для инициализации бд, запуска проекта, сборки всех нужных функций

import (
	"log" // логирование ошибок и информации
	//"net/http"

	"fmt"
	"os"

	"github.com/jmoiron/sqlx"

	_ "github.com/lib/pq"

	"github.com/MIrrox27/REST-API/internal/adapter/http"
)

func initDB() *sqlx.DB {
	// 1. Получаем строку подключения (DSN).
	// DSN (Data Source Name) - это строка с логином, паролем, хостом и именем БД.
	// В идеале, она должна браться из настроек окружения (безопасность!).
	dsn := os.Getenv("DATABASE_URL")
	if dsn == "" {
		// Заглушка, если переменная окружения не установлена
		log.Println("\n\n--Используется DSN по умолчанию. Установите DATABASE_URL в продакшене.")
		dsn = "user=postgres password=1234 host=localhost dbname=REST-API sslmode=disable"
	}

	// 2. Устанавливаем соединение:
	// sqlx.Connect:
	//   - Первый параметр ("postgres"): Говорит, какой зарегистрированный драйвер использовать.
	//   - Второй параметр (dsn): Строка подключения.
	db, err := sqlx.Connect("postgres", dsn)
	if err != nil {
		// Если ошибка - приложение не может работать, завершаем работу
		log.Fatalf("❌ Ошибка подключения к PostgreSQL: %v", err)
	}

	// 3. Настройка пула (опционально)
	db.SetMaxOpenConns(25)

	fmt.Println("--🎉 Успешное подключение к базе данных!")
	return db
}

func main() {

	db := initDB()

	// 'defer' гарантирует, что соединение будет закрыто, когда main() завершит работу.
	defer db.Close()

	fmt.Println()
	http.NewServer()
}
